 ADD: PROCEDURE OPTIONS(MAIN);

    DCL INP1   FIXED DECIMAL(5);
    DCL INP2   FIXED DECIMAL(5);
    DCL RESULT FIXED DECIMAL(6);

    GET LIST(INP1,INP2);

    RESULT = INP1 + INP2;

    PUT LIST('SUM OF TWO NUMBERS',RESULT);

 END ADD;
