 FORMAT2: PROCEDURE OPTIONS(MAIN);

    DCL MESSAGE CHAR(30);

    MESSAGE = 'PL/I FORMAT RULES VALIDATED';

    PUT SKIP LIST(MESSAGE);

 END FORMAT2;
