 IDENT3: PROCEDURE OPTIONS(MAIN);

    DCL NAME1 CHAR(12);
    DCL NAME2 CHAR(12);

    NAME1 = 'DATA';
    NAME2 = 'NAMES';

    PUT SKIP LIST(NAME1,NAME2);

 END IDENT3;
