 ASSIGN3: PROCEDURE OPTIONS(MAIN);
    DCL NUM1 FIXED DECIMAL(5);
    DCL NUM2 FIXED DECIMAL(5);
    DCL RESULT FIXED DECIMAL(6);
    NUM1 = 10;
    NUM2 = 20;
    RESULT = NUM1 + NUM2;
    PUT SKIP LIST('NUM1:',NUM1);
    PUT SKIP LIST('NUM2:',NUM2);
    PUT SKIP LIST('RESULT:',RESULT);
 END ASSIGN3;
