 LISTIO3: PROCEDURE OPTIONS(MAIN);
    DCL NUM1 FIXED DECIMAL(5);
    DCL NUM2 FIXED DECIMAL(5);
    PUT SKIP LIST('ENTER TWO NUMBERS:');
    GET LIST(NUM1,NUM2);
    PUT SKIP LIST('VALUES READ:',NUM1,NUM2);
 END LISTIO3;
